---
kind: method
id: M:Autodesk.Revit.DB.ModelCurveArrArray.ForwardIterator
source: html/9390f75b-54b2-b9d7-96be-cb8ff0b345de.htm
---
# Autodesk.Revit.DB.ModelCurveArrArray.ForwardIterator Method

Retrieve a forward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual ModelCurveArrArrayIterator ForwardIterator()
```

## Returns
Returns a forward moving iterator to the array.